
&НаСервере
Процедура КнопкаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ДенежныеСредстваОстаткиИОбороты.Счёт КАК Счёт
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты КАК ДенежныеСредстваОстаткиИОбороты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтруктурСчёт = Новый Соответствие();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктурСчёт.Вставить(ВыборкаДетальныеЗаписи.Счёт, ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток);
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланДенежныеСредстваОбороты.Счёт КАК Счёт,
		|	ПланДенежныеСредстваОбороты.СтатьяДДС КАК СтатьяДДС,
		|	ПланДенежныеСредстваОбороты.СуммаПриход КАК СуммаПриход,
		|	ПланДенежныеСредстваОбороты.СуммаРасход КАК СуммаРасход,
		|	ПланДенежныеСредстваОбороты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.ПланДенежныеСредства.Обороты(&НачалоПериода,, Секунда,) КАК ПланДенежныеСредстваОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
		
		Запрос.УстановитьПараметр("НачалоПериода", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НачальныйОстаток = 1;
	КонечныйОстаток = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СтруктурСчёт.Получить(ВыборкаДетальныеЗаписи.Счёт) <> Неопределено Тогда
			НачальныйОстаток = СтруктурСчёт.Получить(ВыборкаДетальныеЗаписи.Счёт);
		Иначе
			НачальныйОстаток = 0;
		КонецЕсли;
		КонечныйОстаток = НачальныйОстаток + ВыборкаДетальныеЗаписи.СуммаПриход - ВыборкаДетальныеЗаписи.СуммаРасход;
		
		НоваяСтрока = ПлатёжныйКалендарь.Добавить();
		
		НоваяСтрока.Дата = ВыборкаДетальныеЗаписи.Период;
		НоваяСтрока.НачальныйОстаток = НачальныйОстаток;
		НоваяСтрока.Счёт = ВыборкаДетальныеЗаписи.Счёт;
		НоваяСтрока.Статья = ВыборкаДетальныеЗаписи.СтатьяДДС;
		НоваяСтрока.СуммаПриход = ВыборкаДетальныеЗаписи.СуммаПриход;
		НоваяСтрока.СуммаРасход = ВыборкаДетальныеЗаписи.СуммаРасход;
		НоваяСтрока.КонечныйОстаток = КонечныйОстаток;
		СтруктурСчёт.Вставить(ВыборкаДетальныеЗаписи.Счёт, КонечныйОстаток);
		Если КонечныйОстаток < 0 Тогда
			Сообщить(Строка(ВыборкаДетальныеЗаписи.Период) + " на счету " + Строка(ВыборкаДетальныеЗаписи.Счёт) + " баланс ниже нуля");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка(Команда)
	ПлатёжныйКалендарь.Очистить();
	КнопкаНаСервере();
КонецПроцедуры
