
&НаСервере
Процедура КнопкаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ДенежныеСредстваОстаткиИОбороты.Счёт КАК Счёт,
		|	ДенежныеСредстваОстаткиИОбороты.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты КАК ДенежныеСредстваОстаткиИОбороты";
	
	РезультатЗапроса = Запрос.Выполнить();
	Номер = 1;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтруктурСчёт = Новый Соответствие();
	Если Элементы.Найти("ГруппаКарточек") <> Неопределено Тогда
    	Элементы.Удалить(Элементы.ГруппаКарточек);
	КонецЕсли;
	
	Группа = Элементы.Добавить(
    	"ГруппаКарточек",
    	Тип("ГруппаФормы"),
    	Элементы.Группа3
	);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктурСчёт.Вставить(ВыборкаДетальныеЗаписи.Счёт, ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток);
		ДекорацияСчёт = Элементы.Добавить(
        	"Декорация" + Строка(Номер),
        	Тип("ДекорацияФормы"),
        	Элементы.ГруппаКарточек);

    	ДекорацияСчёт.Вид = ВидДекорацииФормы.Надпись;
    	ДекорацияСчёт.Заголовок = ВыборкаДетальныеЗаписи.Счёт;
    	ДекорацияСчёт.ЦветФона = Новый Цвет(173, 216, 230);
    	ДекорацияСумма = Элементы.Добавить(
        	"Декорация" + Строка(Номер+1),
        	Тип("ДекорацияФормы"),
        	Элементы.ГруппаКарточек);

    	ДекорацияСумма.Вид = ВидДекорацииФормы.Надпись;
    	ДекорацияСумма.Заголовок = Строка(ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток) + " " + Строка(ВыборкаДетальныеЗаписи.Валюта);
    	Если ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток > 0 Тогда
    		ДекорацияСумма.ЦветФона = Новый Цвет(0, 128, 0);
    	Иначе
    		ДекорацияСумма.ЦветФона = Новый Цвет(255, 0, 0);
    	КонецЕсли;
    	ДекорацияСчёт.РастягиватьПоГоризонтали = Истина;
		ДекорацияСумма.РастягиватьПоГоризонтали = Истина;
		Номер = Номер + 2;
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланДенежныеСредстваОбороты.Счёт КАК Счёт,
		|	ПланДенежныеСредстваОбороты.СтатьяДДС КАК СтатьяДДС,
		|	ПланДенежныеСредстваОбороты.СуммаПриход КАК СуммаПриход,
		|	ПланДенежныеСредстваОбороты.СуммаРасход КАК СуммаРасход,
		|	ПланДенежныеСредстваОбороты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.ПланДенежныеСредства.Обороты(&НачалоПериода,, Секунда,) КАК ПланДенежныеСредстваОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
		
		Запрос.УстановитьПараметр("НачалоПериода", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НачальныйОстаток = 1;
	КонечныйОстаток = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СтруктурСчёт.Получить(ВыборкаДетальныеЗаписи.Счёт) <> Неопределено Тогда
			НачальныйОстаток = СтруктурСчёт.Получить(ВыборкаДетальныеЗаписи.Счёт);
		Иначе
			НачальныйОстаток = 0;
		КонецЕсли;
		КонечныйОстаток = НачальныйОстаток + ВыборкаДетальныеЗаписи.СуммаПриход - ВыборкаДетальныеЗаписи.СуммаРасход;
		
		НоваяСтрока = ПлатёжныйКалендарь.Добавить();
		
		НоваяСтрока.Дата = ВыборкаДетальныеЗаписи.Период;
		НоваяСтрока.НачальныйОстаток = НачальныйОстаток;
		НоваяСтрока.Счёт = ВыборкаДетальныеЗаписи.Счёт;
		НоваяСтрока.Статья = ВыборкаДетальныеЗаписи.СтатьяДДС;
		НоваяСтрока.СуммаПриход = ВыборкаДетальныеЗаписи.СуммаПриход;
		НоваяСтрока.СуммаРасход = ВыборкаДетальныеЗаписи.СуммаРасход;
		НоваяСтрока.КонечныйОстаток = КонечныйОстаток;
		СтруктурСчёт.Вставить(ВыборкаДетальныеЗаписи.Счёт, КонечныйОстаток);
		Если КонечныйОстаток < 0 Тогда
			Сообщить(Строка(ВыборкаДетальныеЗаписи.Период) + " на счету " + Строка(ВыборкаДетальныеЗаписи.Счёт) + " баланс ниже нуля");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка(Команда)
	ПлатёжныйКалендарь.Очистить();
	ОчиститьСообщения();
	КнопкаНаСервере();
КонецПроцедуры
