#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ПланДенежныеСредства.Записывать = Истина;
	Статья = СтатьяДДС.ПолучитьОбъект();
	ТипОперации = Статья.ТипДдс;

	// ==========================
	// ДОХОД
	// ==========================
	Если ТипОперации = ПредопределенноеЗначение("Перечисление.ТипДДС.Доход") Тогда

		ДобавитьДвижение(
			ВидДвиженияНакопления.Приход,
			Счёт,
			СтатьяДДС,
			Валюта,
			Сумма,
			Статус);

	// ==========================
	// РАСХОД
	// ==========================
	ИначеЕсли ТипОперации = ПредопределенноеЗначение("Перечисление.ТипДДС.Расход") Тогда

		ДобавитьДвижение(
			ВидДвиженияНакопления.Расход,
			Счёт,
			СтатьяДДС,
			Валюта,
			Сумма,
			Статус);

	// ==========================
	// ПЕРЕВОД
	// ==========================
	ИначеЕсли ТипОперации = ПредопределенноеЗначение("Перечисление.ТипДДС.Перевод") Тогда

		ДобавитьДвижение(
			ВидДвиженияНакопления.Расход,
			Счёт,
			СтатьяДДС,
			Валюта,
			Сумма,
			Статус);
		ДобавитьДвижение(
			ВидДвиженияНакопления.Приход,
			СчётПолучателя,
			СтатьяДДС,
			Валюта,
			Сумма,
			Статус);

	КонецЕсли;

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
Процедура ДобавитьДвижение(
	ВидДвижения,
	Счёт,
	СтатьяДДС,
	Валюта,
	Сумма,
	Статус)
	Если Статус = ПредопределенноеЗначение("Перечисление.Статус.План") Тогда
		Движение = Движения.ПланДенежныеСредства.Добавить();
	Иначе
		Движение = Движения.ДенежныеСредства.Добавить();
	КонецЕсли;

	Движение.ВидДвижения = ВидДвижения;

	Движение.Период = Дата;
	
	Движение.Дата = Дата;

	Движение.Счёт = Счёт;

	Движение.СтатьяДДС = СтатьяДДС;

	Движение.Валюта = Валюта;

	Движение.Сумма = Сумма;

КонецПроцедуры
#КонецОбласти