#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура СтатьяДДСПриИзменении(Элемент)
	Элементы.СчётПолучателя.Видимость = ЭтоПеревод(Объект.СтатьяДДС);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ЭтоПеревод(СтатьяСсылка)

    Если Не ЗначениеЗаполнено(СтатьяСсылка) Тогда
        Возврат Ложь;
    КонецЕсли;

    Статья = СтатьяСсылка.ПолучитьОбъект();

     Возврат Статья.ТипДДС = ПредопределенноеЗначение("Перечисление.ТипДДС.Перевод");

КонецФункции
#КонецОбласти

